Repository: GitSt0n3/bApp
Catalog: lib/l10n/app_*.arb
Languages: es

# bienvenida
source: Welcome to BarberiApp
es: Bienvenido a BarberiApps

# irAMapa
source: Find barbershops
es: Mapa Barberías

# irABarberias
source: Barbers
es: Barberias

# irATurnos
source: Available appointments
es: Ver turnos

# irADomicilio
source: Home barbers
es: Barberos a domicilio

# soyBarbero
source: I am Barber
es: Soy Barbero

# soporte
source: Support
es: Soporte

# servicios
source: Services
es: Servicios

source: New service
es: Nuevo servicio

# enterName
source: Enter a name
es: Ingresá un nombre

# buscarServicio
source: Find a service or barbershop...
es: Buscar servicio o barberia...

# aDomicilio
source: Home service
es: A domicilio

# enBarberia
source: At barbershop
es: A Barberia

# noHayServiciosDisponibles
source: No services available
es: No servicios disponibles

# errorCargandoServicios
source: Error loading services:
es: Error cargando servicios:

# errorCargandoPerfil
source: Error loading profile
es: Error cargando Perfil

# errorCargandoBarberia
source: Error loading barbershop
es: Error cargando barberia

# ubicacionServiciosDeshabilitados
source: Location services disabled
es: Servicios de ubicación deshabilitados

# ubicacionNoSePudoObtener
source: Could not get location:
es: No se pudo obtener ubicación:

# urlReservasInvalida
source: Invalid booking URL
es: URL de reservas inválida

# debeDefinirUbicacionBase
source: To offer home service, define your base location
es: Para ofrecer a domicilio, define tu ubicación base

# perfilActualizado
source: Profile updated
es: Perfil actualizado

# errorGuardando
source: Error saving:
es: Error guardando:

# ofrezcoDomicilio
source: I offer home service
es: Ofrezco trabajo a domicilio

# direccionBaseLabel
source: Base address (optional)
es: Dirección base (opcional)

# radioKm
source: Radius (km):
es: Radio (km):

# direccionLugarHolder
source: Street, number, neighborhood…
es: Calle, nro, barrio…

# usarmiubicacionctual
source: Use my current location
es: Usar mi ubicación actual

# selectorMapaPendiente
source: Map selector: pending
es: Selector de mapa: pendiente

# barberiaNoEncontrada
source: Barbershop not found
es: Barbería no encontrada

# reservarExterno
source: Book (external)
es: Reservar (externo)

# verServicios
source: View Services
es: Ver Servicios

# verPerfil
source: View Profile
es: Ver Perfil

# elegirEnMapa
source: Pick on map
es: Elegir en mapa

# cambiarEnMapa
source: Change on map
es: Cambiar en mapa

# redesSocialesTitulo
source: Social media
es: Redes sociales

# instagramHint
source: https://instagram.com/my_username
es: https://instagram.com/mi_usuario

# facebookHint
source: https://facebook.com/my_page
es: https://facebook.com/mi_pagina

# tiktokHint
source: https://www.tiktok.com/@my_username
es: https://www.tiktok.com/@mi_usuario

# appReservasTitulo
source: Booking app
es: App de reservas

# proveedorLabel
source: Provider
es: Proveedor

# proveedorNinguna
source: None
es: Ninguna

# proveedorOtra
source: Other
es: Otra

# urlReservasLabel
source: Booking URL
es: URL de reservas

# urlReservasHintWeiBook
source: https://weibook.uy/your_barber
es: https://weibook.uy/tu_barber

# urlReservasHintOtra
source: https://my-bookings.com/user
es: https://mi-reservas.com/usuario

# guardarBtn
source: Save
es: Guardar

# barberoAuthTitulo
source: Barber access
es: Acceso para barbero

# iniciarSesion
source: Sign in
es: Iniciar sesión

# continuarConGoogle
source: Continue with Google
es: Continuar con Google

# continuarConApple
source: Continue with Apple
es: Continuar con Apple

# cerrarSesion
source: Sign out
es: Cerrar sesión

# ingresoExitoso
source: Signed in successfully
es: Ingreso exitoso

# errorAutenticando
source: Sign-in error
es: Error autenticando

# registrarme
source: Sign up
es: Registrarme

# emailInvalido
source: Invalid email
es: Email inválido

# contrasenaLabel
source: Password
es: Contraseña

# contrasenaMin6
source: At least 6 characters
es: Mínimo 6 caracteres

# entrar
source: Sign in
es: Entrar

# nombreApellidoLabel
source: Full name
es: Nombre y apellido

# requerido
source: Required
es: Requerido

# telefonoLabel
source: Phone
es: Teléfono

# telefonoInvalido
source: Invalid phone number
es: Teléfono inválido

# repetirContrasenaLabel
source: Repeat password
es: Repetir contraseña

# contrasenaNoCoincide
source: Doesn't match
es: No coincide

# ofrezcoDomicilioToggle
source: I offer home service
es: Ofrezco servicio a domicilio

# toggleDomicilioHint
source: You can enable/disable it later
es: Podrás activarlo/desactivarlo luego

# crearCuenta
source: Create account
es: Crear cuenta

# crearBarberia
source: Create barbershop
es: Crear Barberia

# nombre
source: Name
es: Nombre

# direccion
source: Address
es: Dirección

# seleccionaEnMapa
source: Select on the map
es: Seleccioná en el mapa

# crear
source: Create
es: Crear

# seleccionaUbicacion
source: Select location
es: Seleccioná ubicación

# seleccionaBarberiaODomicilio
source: Select a barbershop or choose "Home service".
es: Seleccioná una barbería o marcá "A domicilio".

# duracionMinima30
source: Minimum duration is 30 minutes.
es: La duración mínima es 30 minutos.

# diasEntre1y31
source: Days must be between 1 and 31.
es: Los días deben estar entre 1 y 31.

# tramoHorarioInsuficiente
source: The daily time window isn't long enough for an appointment.
es: El tramo horario diario no alcanza para un turno.

# turnosGeneradosOk
source: Time slots generated 👌
es: Turnos generados 👌

# generarTurnosTitulo
source: Generate time slots
es: Generar turnos

# barberia
source: Barbershop
es: Barberia

# horaInicio
source: Start
es: Inicio

# horaFin
source: End
es: Fin

# duracionTurnoMin
source: Slot duration (min)
es: Duración del turno (min)

# diasAGenerarLabel
source: Days to generate (1–31)
es: Días a generar (1-31)

# diasAGenerarHelper
source: Maximum 31 days to match monthly subscription
es: Máximo 31 días para controlar la suscripción mensual

# generar
source: Generate
es: Generar

# panelBarberoTitulo
source: Barber panel
es: Panel barbero

# misBarberias
source: My barbershops
es: Mis barberías

# configurarMiBarberia
source: Set up my barbershop
es: Configurar mi barbería

# turnos
source: Appointments
es: Turnos

# miPerfil
source: My profile
es: Mi perfil

# configurarMiBarberiaTitulo
source: Set up my barbershop
es: Configurar mi barbería

# sinBarberiasVinculadas
source: You don't have any linked barbershops yet
es: Aún no tenés barberías vinculadas

# crearMiBarberia
source: Create my barbershop
es: Crear mi barbería

# solicitarVinculoProximamente
source: Request link (coming soon)
es: Solicitar vínculo (próximamente)

# noPudimosCargarBarberias
source: Couldn't load barbershops
es: No pudimos cargar las barberías

# verEnMapa
source: View on map
es: Ver en mapa

# errorCargandoBarberosDomicilio
source: Error loading home barbers
es: Error cargando barberos a domicilio

# distanciaLabel
source: Distance:
es: Distancia:

# recargoDomicilioLabel
source: Home service surcharge:
es: Recargo a domicilio:

# homeServiciosDomicilioTitle
source: Home services
es: Servicios a domicilio

# homeServiciosDomicilioSubtitle
source: Haircuts, shaving, combos — near your location
es: Cortes, afeitado, combos — cerca de tu ubicación

# homeBarberosDomicilioTitle
source: Home barbers
es: Barberos a domicilio

# homeBarberosDomicilioSubtitle
source: Barbers serving your area
es: Barberos que atienden en tu zona

# priceLabel
source: Price (UYU)
es: Precio (UYU)

# enterPrice
source: Enter a price
es: Ingresá un precio

source: Invalid price
es: Precio inválido

# durationMinutes
source: Duration (min)
es: Duración (min)

# servicioGuardado
source: Service saved
es: Servicio guardado

# noSePudoGuardar
source: Couldn't save
es: No se pudo guardar

# errorDesconocido
source: Unknown error
es: Error desconocido

# eliminarServicioTitulo
source: Delete service
es: Eliminar servicio

# eliminarServicioPregunta
source: Are you sure you want to delete this service?
es: ¿Seguro que querés eliminar este servicio?

# cancelar
source: Cancel
es: Cancelar

# eliminar
source: Delete
es: Eliminar

source: Edit
es: Editar

# activos
source: Active
es: Activos

# activo
source: Active
es: Activo

# inactiveChip
source: Inactive
es: Inactivo

source: Duplicate
es: Duplicar

source: Delete
es: Borrar

# vinculacion
source: Linking
es: Vinculación

# servicioEliminado
source: Service deleted
es: Servicio eliminado

# noSePuedeBorrarTieneCitas
source: Can't delete because it has associated appointments. Disable the service to hide it.
es: No se puede borrar porque tiene citas asociadas. Desactivá el servicio para ocultarlo.

# noSePudoBorrarPermisoRestriccion
source: Couldn't delete (permission or constraint)
es: No se pudo borrar (permiso o restricción)

# noSePudoBorrar
source: Couldn't delete
es: No se pudo borrar

# integrarGenerarTurnosHint
source: Hook up navigation to "Generate time slots"
es: Integrar navegación a "Generar turnos"

# surchargePlus
source: + Surcharge
es: + Recargo

# chooseBarbershop
source: Choose a barbershop
es: Elegí una barbería

source: All my barbershops
es: Todas mis barberías

# noBarbershopsMember
source: You are not a member of any barbershop
es: No sos miembro de barberías

source: Invalid amount
es: Monto inválido

# waMensajeOrigenApp
source: Hi, I’m coming from {appName}.
es: Hola, vengo de {appName}.
